1. Establish a terminal session and perform basic configuration to router R1:
(i) Enter privileged EXEC mode:
Router>enable 
Router#
(ii) Clear the configuration:
Router#erase startup-config
(iii) Reload configuration:
Router#reload
(iv) Configure the router name as R1:
Router(config)#hostname R1
(v) Disable DNS lookup: 
R1(config)#no ip domain-lookup
(vi) Configure the EXEC mode password:
R1(config)#enable secret class
(vii) Configure a message-of-the-day banner:
R1(config)#banner motd & Thank you for paying a visit to my router &
(viii) Configure the console password on the router:
R1(config)#line console 0 
R1(config-line)#password cisco 
R1(config-line)#login
(ix) Configure the password for the virtual terminal lines:
R1(config)#line vty 0 4 
R1(config-line)#password cisco 
R1(config-line)#login
(x) Configure the FastEthernet0/0 interface:
R1(config)#interface fastethernet 0/0 
R1(config-if)#ip address 192.168.1.1 255.255.255.0
R1(config-if)#no shutdown
(xi) Configure the Serial0/0/0 interface:
R1(config-if)#interface serial 0/0/0 
R1(config-if)#ip address 192.168.2.1 255.255.255.0
R1(config-if)#clock rate 64000
R1(config-if)#no shutdown
(xii) Save the R1 configuration:
R1#copy run start


2)Configure IP Addressing on the Host PC1:
IP:  192.168.1.10
Subnet Mask: 255.255.255.0
Default gateway: 192.168.1.1


3)Establish a terminal session and perform basic configuration to router R2:
(i) Enter privileged EXEC mode:
Router>enable 
Router#
(ii) Clear the configuration:
Router#erase startup-config
(iii) Reload configuration:
Router#reload
(iv) Configure the router name as R2:
Router(config)#hostname R2
(v) Disable DNS lookup: 
R2(config)#no ip domain-lookup
(vi) Configure the EXEC mode password:
R2(config)#enable secret class
(vii) Configure a message-of-the-day banner:
R2(config)#banner motd & Welcome to PC2 &
(viii) Configure the console password on the router:
R2(config)#line console 0 
R2(config-line)#password cisco 
R2(config-line)#login
(ix) Configure the password for the virtual terminal lines:
R2(config)#line vty 0 4 
R2(config-line)#password cisco 
R2(config-line)#login
(x) Configure the FastEthernet0/0 interface:
R2(config)#interface fa 0/0 
R2(config-if)#ip address 192.168.3.1 255.255.255.0
R2(config-if)#no shutdown
(xi) Configure the Serial0/0/0 interface:
R2(config-if)#interface serial 0/0/0 
R2(config-if)#ip address 192.168.2.2 255.255.255.0
R2(config-if)#no shutdown
(xii) Save the R2 configuration:
R2#copy run start


4)Configure IP Addressing on the Host PC2:
IP:  192.168.3.10
Subnet Mask: 255.255.255.0
Default gateway: 192.168.3.1